ci4_att/app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos ['datos']=$clientes->findAll();